app/views/supplier_accounts/edit_user_privileges.html.erb

	<div style="margin:10px 0px 10px 20px">
	<% for store_admin_privilege in StoreAdminPrivilege.all %>
		<p><%= check_box_tag("user[store_admin_privilege_ids][]", store_admin_privilege.id, (@user.store_admin_privileges.include? store_admin_privilege),
				:class => "store_admin_privilege_#{store_admin_privilege.id}") %>
---
SELECT `store_admin_privileges`.* FROM `store_admin_privileges`
SELECT 1 AS one FROM `store_admin_privileges` INNER JOIN `store_admin_privileges_users` ON `store_admin_privileges`.`id` = `store_admin_privileges_users`.`store_admin_privilege_id` WHERE `store_admin_privileges_users`.`user_id` = 1 AND `store_admin_privileges`.`id` = 1 LIMIT 1