app/views/supplier_accounts/show.html.erb

SELECT `users`.* FROM `users` INNER JOIN `supplier_accounts_users` ON `users`.`id` = `supplier_accounts_users`.`user_id` WHERE `supplier_accounts_users`.`supplier_account_id` = 1
---
<ul>
<% @supplier_account.users.each do |user| %>