app/views/store_admin/_shopping_cart.html.erb

<div class="row">
<% @shopping_cart.shopping_cart_items.each do |sci| %>
---
SELECT `shopping_cart_items`.* FROM `shopping_cart_items` WHERE `shopping_cart_items`.`shopping_cart_id` = 8

			<b><%= sci.product_stock_size.product.name.capitalize %></b>
			<div style="margin-top:10px"><%= image_tag(sci.product_stock_size.product.product_images.first.photo.url(:index_dress)) %></div>
---
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 5 ORDER BY `product_images`.`id` ASC LIMIT 1
SELECT `products`.* FROM `products` WHERE `products`.`id` = 5 LIMIT 1

		  	<strong>Precio:</strong> <%= number_to_currency sci.product_stock_size.product.price %> |
			<strong>Talla:</strong> <%= sci.product_stock_size.size.name unless sci.product_stock_size.size.nil? %> |
---
SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 2 LIMIT 1

		<div>
			<% PaymentMethod.all.each do |pm| %>
---
SELECT `payment_methods`.* FROM `payment_methods`