app/controllers/product_categories_controller.rb

SELECT `product_categories`.* FROM `product_categories`
---
  def index
    @product_categories = ProductCategory.all

INSERT INTO `product_categories` (`created_at`, `name`, `supplier_account_id`, `updated_at`) VALUES ('2014-05-10 02:55:34', 'Polerones', 1, '2014-05-10 02:55:34')
---
  def create
    @product_category = ProductCategory.new(product_category_params)

    respond_to do |format|
      if @product_category.save

UPDATE `product_categories` SET `supplier_account_id` = 1, `updated_at` = '2014-05-10 02:55:16' WHERE `product_categories`.`id` = 1
---
  def update
    respond_to do |format|
      if @product_category.update(product_category_params)

DELETE FROM `product_categories` WHERE `product_categories`.`id` = 1
---
  def destroy
    @product_category.destroy

SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`id` = 1 LIMIT 1
---
    def set_product_category
      @product_category = ProductCategory.find(params[:id])

SELECT `supplier_accounts`.* FROM `supplier_accounts` WHERE `supplier_accounts`.`id` = 1 LIMIT 1
---
    def set_supplier_account
      @supplier_account = SupplierAccount.find(params[:supplier_account_id])