app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT `products`.* FROM `products`

  def show
    @product.product_stock_sizes.each do |psz|
      @barcode_value = psz.generate_barcode
      @full_path = "#{Rails.root}/public/system/barcodes/"+@product.supplier_account.name+'/'+psz.size.name+'_'+psz.color+'_'+@product.id.to_s+"_barcode.png"
---
SELECT COUNT(*) FROM `product_stock_sizes` WHERE `product_stock_sizes`.`product_id` = 5
SELECT `product_stock_sizes`.* FROM `product_stock_sizes` WHERE `product_stock_sizes`.`product_id` = 5
SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 2 LIMIT 1

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`cost`, `created_at`, `description`, `name`, `price`, `supplier_account_id`, `updated_at`) VALUES (200, '2014-05-09 19:13:11', 'hola', 'hola', 299, 1, '2014-05-09 19:13:11')

  def destroy
    @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 1

    def set_product
      @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 5 LIMIT 1

    def set_supplier_account
      @supplier_account = SupplierAccount.find(params[:supplier_account_id])
---
SELECT `supplier_accounts`.* FROM `supplier_accounts` WHERE `supplier_accounts`.`id` = 1 LIMIT 1