app/controllers/sizes_controller.rb

  def index
    @sizes = Size.all
---
SELECT `sizes`.* FROM `sizes`

  def create
    @size = Size.new(size_params)

    respond_to do |format|
      if @size.save
---
INSERT INTO `sizes` (`created_at`, `name`, `supplier_account_id`, `updated_at`) VALUES ('2014-05-10 02:47:28', 'Xs', 1, '2014-05-10 02:47:28')

  def update
    respond_to do |format|
      if @size.update(size_params)
---
UPDATE `sizes` SET `name` = 'XS', `updated_at` = '2014-05-10 02:47:32' WHERE `sizes`.`id` = 11

  def destroy
    @size.destroy
---
DELETE FROM `sizes` WHERE `sizes`.`id` = 1

    def set_size
      @size = Size.find(params[:id])
---
SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 11 LIMIT 1

    def set_supplier_account
      @supplier_account = SupplierAccount.find(params[:supplier_account_id])
---
SELECT `supplier_accounts`.* FROM `supplier_accounts` WHERE `supplier_accounts`.`id` = 1 LIMIT 1