app/controllers/store_admin_controller.rb

INSERT INTO `shopping_carts` (`created_at`, `updated_at`, `user_id`) VALUES ('2014-05-09 22:24:18', '2014-05-09 22:24:18', 1)
SELECT `shopping_carts`.* FROM `shopping_carts` WHERE `shopping_carts`.`id` = 8 LIMIT 1
---
  def point_of_sale
    @shopping_cart = params[:shopping_cart_id].blank? ? ShoppingCart.create(user_id: current_user.id) : ShoppingCart.find(params[:shopping_cart_id])

SELECT `shopping_carts`.* FROM `shopping_carts` WHERE `shopping_carts`.`id` = 12 LIMIT 1
SELECT `product_stock_sizes`.* FROM `product_stock_sizes` WHERE `product_stock_sizes`.`id` = 1 LIMIT 1
INSERT INTO `shopping_cart_items` (`created_at`, `product_stock_size_id`, `quantity`, `shopping_cart_id`, `updated_at`) VALUES ('2014-05-09 22:11:54', 1, 1, 5, '2014-05-09 22:11:54')
INSERT INTO `shopping_carts` (`created_at`, `updated_at`, `user_id`) VALUES ('2014-05-09 22:05:04', '2014-05-09 22:05:04', 1)
---
  def add_product_to_cart_from_barcode
    begin
      @shopping_cart = ShoppingCart.find params[:shopping_cart_id] if !params[:shopping_cart_id].nil?
      barcode = params[:barcode]
      product_stock_size_id = barcode[0..11].to_i

      product_stock_size = ProductStockSize.find product_stock_size_id
      unless product_stock_size.blank?
        if product_stock_size.stock == 0
          redirect_to point_of_sale_path(id: @supplier_account.id, shopping_cart_id: @shopping_cart.id), notice: 'Error: Producto Agotado en el Sistema'
        else
          @shopping_cart.shopping_cart_items << ShoppingCartItem.create(shopping_cart_id: @shopping_cart.id, product_stock_size_id: product_stock_size.id, quantity: 1)

SELECT `shopping_carts`.* FROM `shopping_carts` WHERE `shopping_carts`.`id` = 15 LIMIT 1
UPDATE `shopping_carts` SET `status` = 'comprado', `updated_at` = '2014-05-09 23:33:38' WHERE `shopping_carts`.`id` = 15
SELECT `shopping_cart_items`.* FROM `shopping_cart_items` WHERE `shopping_cart_items`.`shopping_cart_id` = 15
UPDATE `product_stock_sizes` SET `stock` = -1, `updated_at` = '2014-05-09 23:36:02' WHERE `product_stock_sizes`.`id` = 2
INSERT INTO `purchases` (`created_at`, `payment_method_id`, `shopping_cart_id`, `updated_at`) VALUES ('2014-05-09 23:42:08', 1, 15, '2014-05-09 23:42:08')
---
  def generate_purchase
    begin
      @shopping_cart = ShoppingCart.find params[:shopping_cart_id]
      #Disable Cart
      @shopping_cart.update_attribute :status, 'comprado'
      #Reduce Stock
      @shopping_cart.shopping_cart_items.each do |sci|
        sci.product_stock_size.update_attribute :stock, sci.product_stock_size.stock - 1
      end
      buyer_email = params[:email_buyer]
      payment_method = params[:medio_pago]
      Purchase.create(payment_method_id: payment_method, buyer_email: buyer_email, shopping_cart_id: @shopping_cart.id, supplier_account_id: @supplier_account.id, paid_amount: @shopping_cart.price)

SELECT `shopping_carts`.* FROM `shopping_carts` WHERE `shopping_carts`.`id` = 15 LIMIT 1
SELECT `shopping_cart_items`.* FROM `shopping_cart_items` WHERE `shopping_cart_items`.`id` = 13 LIMIT 1
---
  def remove_product_from_cart
    shopping_cart = ShoppingCart.find params[:shopping_cart_id]
    shopping_cart_item = ShoppingCartItem.find params[:shopping_cart_item_id]

SELECT `supplier_accounts`.* FROM `supplier_accounts` WHERE `supplier_accounts`.`id` = 1 LIMIT 1
---
    def set_supplier_account
      @supplier_account = SupplierAccount.find(params[:id])