app/controllers/supplier_accounts_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'hhanckes@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1
---
  def add_user
    user = User.where(:email => params[:user_email]).first

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def edit_user_privileges
    @user = User.find params[:user_id]

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def update_user
    @user = User.find(params[:user_id])

SELECT `supplier_accounts`.* FROM `supplier_accounts`
---
  def index
    @supplier_accounts = SupplierAccount.all

INSERT INTO `supplier_accounts` (`created_at`, `name`, `updated_at`) VALUES ('2014-05-09 03:21:06', 'Picaflor', '2014-05-09 03:21:06')
---
  def create
    @supplier_account = SupplierAccount.new(supplier_account_params)

    respond_to do |format|
      if @supplier_account.save

SELECT `supplier_accounts`.* FROM `supplier_accounts` WHERE `supplier_accounts`.`id` = 1 LIMIT 1
---
    def set_supplier_account
      @supplier_account = SupplierAccount.find(params[:id])