app/views/products/index.html.erb

        <td><%= number_to_currency product.product_stock_sizes.joins(:supply_purchase_product_sizes).average(:unit_cost) , precision: 0 %></td>
		<td><%= raw product.product_stock_sizes.map{ |psz| psz.stock.to_s+' - '+psz.size.name+' - '+psz.color }.join('<br />') %></td>
---
SELECT `products`.* FROM `products`