app/views/products/show.html.erb

<div class="well">
	<% if @product.product_categories.size > 0 %>
---
SELECT `sizes`.* FROM `sizes` WHERE `sizes`.`id` = 2 LIMIT 1

<div class="well">
<% if @product.product_stock_sizes.size > 0 %>
---
SELECT COUNT(*) FROM `product_stock_sizes` WHERE `product_stock_sizes`.`product_id` = 5
SELECT `product_stock_sizes`.* FROM `product_stock_sizes` WHERE `product_stock_sizes`.`product_id` = 5

<div class="well">
<% if @product.product_images.size > 0 %>
---
SELECT COUNT(*) FROM `product_images` WHERE `product_images`.`product_id` = 3
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 3